In [2]:
# Concat 

import pandas as pd

In [3]:
df1 = pd.DataFrame({
    "city" : ["delhi","mumbai","pune"],
    "temp": [40,35,30],
    "humidity": [60,65,70]
})
df1

     city  temp  humidity
0   delhi    40        60
1  mumbai    35        65
2    pune    30        70

In [4]:
df2 = pd.DataFrame({
    "city" : ["new york","mumbai","banlore"],
    "temp": [50,45,40],
    "humidity": [70,75,60]
})
df2

       city  temp  humidity
0  new york    50        70
1    mumbai    45        75
2   banlore    40        60

In [5]:
df3 = pd.DataFrame({
    "city" : ["new york","mumbai","banlore"],
    "temp": [70,35,30],
    "humidity": [30,25,10]
})
df3

       city  temp  humidity
0  new york    70        30
1    mumbai    35        25
2   banlore    30        10

In [6]:
df = pd.concat([df1,df2,df3])
df

       city  temp  humidity
0     delhi    40        60
1    mumbai    35        65
2      pune    30        70
0  new york    50        70
1    mumbai    45        75
2   banlore    40        60
0  new york    70        30
1    mumbai    35        25
2   banlore    30        10

In [7]:
df = pd.concat([df1,df2,df3],ignore_index=True)
df

       city  temp  humidity
0     delhi    40        60
1    mumbai    35        65
2      pune    30        70
3  new york    50        70
4    mumbai    45        75
5   banlore    40        60
6  new york    70        30
7    mumbai    35        25
8   banlore    30        10

In [8]:
df = pd.concat([df1,df2,df3],ignore_index=True,axis=0)
df

       city  temp  humidity
0     delhi    40        60
1    mumbai    35        65
2      pune    30        70
3  new york    50        70
4    mumbai    45        75
5   banlore    40        60
6  new york    70        30
7    mumbai    35        25
8   banlore    30        10

In [9]:
df = pd.concat([df1,df2,df3],axis=1) # columnn wise concat
df

     city  temp  humidity      city  temp  humidity      city  temp  humidity
0   delhi    40        60  new york    50        70  new york    70        30
1  mumbai    35        65    mumbai    45        75    mumbai    35        25
2    pune    30        70   banlore    40        60   banlore    30        10

In [10]:
df = pd.concat([df1,df2,df3],ignore_index=True) # default row wise merge
df

       city  temp  humidity
0     delhi    40        60
1    mumbai    35        65
2      pune    30        70
3  new york    50        70
4    mumbai    45        75
5   banlore    40        60
6  new york    70        30
7    mumbai    35        25
8   banlore    30        10

# Time Series

In [11]:
# creating a DatetimeIndex from a list of strings
import warnings;

warnings.filterwarnings('ignore')

ls = ["25aug,2025","25th august, 2025","25-08-2025","25/08/2025"]
df_date = pd.to_datetime(ls)
df_date

DatetimeIndex(['2025-08-25', '2025-08-25', '2025-08-25', '2025-08-25'], dtype='datetime64[ns]', freq=None)

In [12]:
df_date[0].year

2025

In [13]:
df_date[0].month

8

In [14]:
df_date[0].day

25

In [15]:
df_date[0].hour

0

In [16]:
# timedelta

In [17]:
df_date + pd.Timedelta('-10 days 5 hours 10 minutes')

DatetimeIndex(['2025-08-14 18:50:00', '2025-08-14 18:50:00',
               '2025-08-14 18:50:00', '2025-08-14 18:50:00'],
              dtype='datetime64[ns]', freq=None)

In [18]:
df_date + pd.Timedelta('+ 5 hours')

DatetimeIndex(['2025-08-25 05:00:00', '2025-08-25 05:00:00',
               '2025-08-25 05:00:00', '2025-08-25 05:00:00'],
              dtype='datetime64[ns]', freq=None)

In [19]:
df_date + pd.Timedelta('+ 60 days')

DatetimeIndex(['2025-10-24', '2025-10-24', '2025-10-24', '2025-10-24'], dtype='datetime64[ns]', freq=None)

# Date_range

## freq

In [20]:
pd.date_range("2023-08-15","2025-08-25",freq='M')

DatetimeIndex(['2023-08-31', '2023-09-30', '2023-10-31', '2023-11-30',
               '2023-12-31', '2024-01-31', '2024-02-29', '2024-03-31',
               '2024-04-30', '2024-05-31', '2024-06-30', '2024-07-31',
               '2024-08-31', '2024-09-30', '2024-10-31', '2024-11-30',
               '2024-12-31', '2025-01-31', '2025-02-28', '2025-03-31',
               '2025-04-30', '2025-05-31', '2025-06-30', '2025-07-31'],
              dtype='datetime64[ns]', freq='ME')

In [21]:
pd.date_range("2023-08-15","2025-08-25",freq='Y')

DatetimeIndex(['2023-12-31', '2024-12-31'], dtype='datetime64[ns]', freq='YE-DEC')

In [22]:
pd.date_range("2023-08-15","2025-08-25",freq='D')

DatetimeIndex(['2023-08-15', '2023-08-16', '2023-08-17', '2023-08-18',
               '2023-08-19', '2023-08-20', '2023-08-21', '2023-08-22',
               '2023-08-23', '2023-08-24',
               ...
               '2025-08-16', '2025-08-17', '2025-08-18', '2025-08-19',
               '2025-08-20', '2025-08-21', '2025-08-22', '2025-08-23',
               '2025-08-24', '2025-08-25'],
              dtype='datetime64[ns]', length=742, freq='D')

## periods

In [23]:
pd.date_range("2025-08-15",periods=5)

DatetimeIndex(['2025-08-15', '2025-08-16', '2025-08-17', '2025-08-18',
               '2025-08-19'],
              dtype='datetime64[ns]', freq='D')

In [24]:
pd.date_range("2025-08-15",periods=5,freq="Y")

DatetimeIndex(['2025-12-31', '2026-12-31', '2027-12-31', '2028-12-31',
               '2029-12-31'],
              dtype='datetime64[ns]', freq='YE-DEC')

In [25]:
pd.date_range("2025-08-15",periods=5,freq="M")

DatetimeIndex(['2025-08-31', '2025-09-30', '2025-10-31', '2025-11-30',
               '2025-12-31'],
              dtype='datetime64[ns]', freq='ME')

In [26]:
pd.date_range("2025-08-15",periods=5,freq="H")

DatetimeIndex(['2025-08-15 00:00:00', '2025-08-15 01:00:00',
               '2025-08-15 02:00:00', '2025-08-15 03:00:00',
               '2025-08-15 04:00:00'],
              dtype='datetime64[ns]', freq='h')

In [28]:
## load dataset

In [27]:
air = pd.read_csv("air_quality_no2.csv")

In [33]:
air.tail(20)

                 datetime  station_antwerp  station_paris  station_london
1015  2019-06-18 09:00:00              NaN           52.6             NaN
1016  2019-06-18 10:00:00              NaN           49.6             NaN
1017  2019-06-18 21:00:00              NaN           15.3             NaN
1018  2019-06-18 22:00:00              NaN           17.0             NaN
1019  2019-06-18 23:00:00              NaN           23.1             NaN
1020  2019-06-19 00:00:00              NaN           39.3             NaN
1021  2019-06-19 11:00:00              NaN           27.3             NaN
1022  2019-06-19 12:00:00              NaN           26.6             NaN
1023  2019-06-20 15:00:00              NaN           19.4             NaN
1024  2019-06-20 16:00:00              NaN           20.1             NaN
1025  2019-06-20 17:00:00              NaN           19.3             NaN
1026  2019-06-20 18:00:00              NaN           19.0             NaN
1027  2019-06-20 19:00:00              NaN           23.2             NaN
1028  2019-06-20 20:00:00              NaN           23.9             NaN
1029  2019-06-20 21:00:00              NaN           25.3             NaN
1030  2019-06-20 22:00:00              NaN           21.4             NaN
1031  2019-06-20 23:00:00              NaN           24.9             NaN
1032  2019-06-21 00:00:00              NaN           26.5             NaN
1033  2019-06-21 01:00:00              NaN           21.8             NaN
1034  2019-06-21 02:00:00              NaN           20.0             NaN